// *++
//
// Copyright (c) 2005 - 2009, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ShellenvHelpStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell shellenv command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_ALIAS_LINE_HELP   #language eng  "Displays, creates, or deletes EFI Shell aliases"

#string STR_SHELLENV_ALIAS_VERBOSE_HELP #language eng "Displays, creates, or deletes aliases in the EFI Shell environment.\n"
                                                      "\n"
                                                      "ALIAS [-d|-v] [sname] [value]\n"
                                                      "\n"
                                                      "    -d       - Deletes an alias\n"
                                                      "    -v       - Volatile variable\n"
                                                      "    sname    - Alias name\n"
                                                      "    value    - Original name\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. 'sname' should not be an internal EFI Shell command.\n"
                                                      "    2. 'value' can be an internal EFI Shell command, a script, or an EFI\n"
                                                      "       application. However, any other values are also acceptable.\n"
                                                      "    3. ALIAS values are stored in EFI NVRAM and will be retained between boots\n"
                                                      "       unless the '-v' option is specified.\n"
                                                      "    4. ALIAS will not add a nonvolatile alias when a volatile alias of the same\n"
                                                      "       name already exists, or vice versa.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display all aliases in the EFI Shell environment:\n"
                                                      "    Shell> alias\n"
                                                      "        md   : mkdir\n"
                                                      "        rd   : rm\n"
                                                      "\n"
                                                      "  * To create an alias in the EFI Shell environment:\n"
                                                      "    Shell> alias myguid guid\n"
                                                      "    Shell> alias\n"
                                                      "        md     : mkdir\n"
                                                      "        rd     : rm\n"
                                                      "        myguid : guid\n"
                                                      "\n"
                                                      "  * To delete an alias in the EFI Shell environment:\n"
                                                      "    Shell> alias -d myguid\n"
                                                      "    Shell> alias\n"
                                                      "        md   : mkdir\n"
                                                      "        rd   : rm\n"
                                                      "\n"
                                                      "  * To add a volatile alias in the current EFI environment, which has a star *\n"
                                                      "    at the line head. This volatile alias will disappear at next boot.\n"
                                                      "    Shell> alias -v fs0 floppy\n"
                                                      "    Shell> alias\n"
                                                      "        md   : mkdir\n"
                                                      "        rd   : rm\n"
                                                      "      * fs0  : floppy\n"

#string STR_SHELLENV_HELP_LINE_HELP     #language eng "Displays the EFI Shell command list or verbose command help"

#string STR_SHELLENV_HELP_VERBOSE_HELP  #language eng "Displays the EFI Shell command list or verbose help for specific commands.\n" 
                                                      "\n" 
                                                      "HELP [cmd | pattern]\n" 
                                                      "\n" 
                                                      "    cmd      - Shell command name\n" 
                                                      "    pattern  - Wildmatch pattern\n"
                                                      "\n" 
                                                      "Note:\n" 
                                                      "    1. 'cmd -?' also displays the verbose help of cmd, the same as 'help cmd'.\n" 
                                                      "    2. If the specified command has no verbose help, its line help will be\n"
                                                      "       displayed instead.\n" 
                                                      "\n" 
                                                      "Examples:\n" 
                                                      "* To display the EFI Shell command list and break after one screen:\n" 
                                                      "  Shell> help -b\n" 
                                                      "  ?          - Displays the EFI Shell command list or verbose command help\n"
                                                      "  alias         - Displays, creates, or deletes aliases in the EFI Shell\n"
                                                      "  attrib     - Displays or changes the attributes of files or directories\n" 
                                                      "  cd         - Displays or changes the current directory\n" 
                                                      "  cls           - Clears the standard output with an optional background color\n" 
                                                      "  connect    - Connects one or more EFI drivers to a device\n" 
                                                      "  copy       - Copies one or more files or directories to another location\n"
                                                      "  ...\n" 
                                                      "\n" 
                                                      "* To display help information for the ls shell command:\n" 
                                                      "  Shell> help ls\n" 
                                                      "  Shell> ? ls\n" 
                                                      "  Shell> ls -?\n" 
                                                      "\n"
                                                      "* To display the list of commands starting with the character 'p'\n"
                                                      "  Shell> help p*\n"
                                                      "  pause      - Prints a message and waits for keyboard input\n"
												      "  pci		- Displays PCI device list or PCI function configuration space\n"
												      
#string STR_SHELLENV_SET_LINE_HELP     #language eng  "Displays or modifies EFI Shell environment variables"

#string STR_SHELLENV_SET_VERBOSE_HELP  #language eng  "Displays, creates, changes, or deletes EFI Shell environment variables.\n"
                                                      "\n"
                                                      "SET [-v] [sname [value]]\n"
                                                      "SET [-d <sname>]\n"
                                                      "\n"
                                                      "    -d       - Deletes the environment variable\n"
                                                      "    -v       - Volatile variable\n"
                                                      "    sname    - Environment variable name\n"
                                                      "    value    - Environment variable value\n"
                                                      "\n"
                                                      "Notes:\n"
                                                      "    1. SET values are stored in EFI NVRAM and will be retained between boots\n"
                                                      "       unless the option -v is specified.\n"
                                                      "    2. The dmpstore command can be used to display EFI Shell NVRAM variables.\n"
                                                      "    3. Available NVRAM storage available for the set command will depend on\n"
                                                      "       the system implementation.\n"
                                                      "    4. SET may store NVRAM variables on the file system /efi/boot/bootstr.nvr\n"
                                                      "       if no NVRAM is implemented by the core EFI routines.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To add an environment variable:\n"
                                                      "    Shell> set DiagnosticPath fs0:\\efi\\diag;fs1:\\efi\\diag\n"
                                                      "\n"
                                                      "  * To display all environment variables:\n"
                                                      "    Shell> set\n"
                                                      "      * path           : .\n"
                                                      "        diagnosticPath : fs0:\\efi1.1\\diag;fs1:\\efi1.1\\diag\n"
                                                      "\n"
                                                      "  * To delete an environment variable:\n"
                                                      "    Shell> set -d diagnosticpath\n"
                                                      "    Shell> set\n"
                                                      "      * path           : .\n"
                                                      "\n"
                                                      "  * To change an environment variable:\n"
                                                      "    fs0:\\> set src efi\n"
                                                      "    fs0:\\> set\n"
                                                      "      * path : .;fs0:\\efi\\tools;fs0:\\efi\\boot;fs0:\\ \n"
                                                      "        src  : efi\n"
                                                      "    fs0:\\> set src efi1.1\n"
                                                      "    fs0:\\> set\n"
                                                      "      * path : .;fs0:\\efi\\tools;fs0:\\efi\\boot;fs0:\\ \n"
                                                      "        src  : efi1.1\n"
                                                      "\n"
                                                      "  * To append an environment variable:\n"
                                                      "    Shell> set\n"
                                                      "      * path           : .\n"
                                                      "    Shell> set path %%path%%;fs0:\\efi\\tools;fs0:\\efi\\boot;fs0:\\ \n"
                                                      "    Shell> set\n"
                                                      "      * path           : .;fs0:\\efi\\tools;fs0:\\efi\\boot;fs0:\\ \n"
                                                      "\n"
                                                      "  * To set a volatile variable that will disappear at the next boot:\n"
                                                      "    Shell> set -v EFI_SOURCE c:\\project\\EFI1.1\n"
                                                      "    Shell> set\n"
                                                      "      * path       : .;fs0:\\efi\\tools;fs0:\\efi\\boot;fs0:\\ \n"
                                                      "      * EFI_SOURCE : c:\\project\\EFI1.1\n"

#string STR_SHELLENV_DH_LINE_HELP      #language eng  "Displays EFI handle information"

#string STR_SHELLENV_DH_VERBOSE_HELP   #language eng  "Displays EFI handle information.\n"
                                                      "\n"
                                                      "DH [-l lang] [handle | -p prot_id] [-d] [-v]\n"
                                                      "\n"
                                                      "    handle   - Handle number in hexadecimal format\n"
                                                      "    -p       - Protocol ID\n"
                                                      "    -d       - Display EFI Driver Model related information\n"
                                                      "    -l       - Display information in the specified language\n"
                                                      "    -v       - Display verbose information\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. When neither 'handle' nor 'prot_id' is specified, a list of all the\n"
                                                      "       device handles in the EFI environment is displayed. \n"
                                                      "    2. The '-d' option displays EFI Driver Model related information including\n"
                                                      "       parent handles, child handles, all drivers installed on the handle, etc.\n"
                                                      "    3. The '-v' option displays verbose information for the specified handle\n"
                                                      "       including all the protocols on the handle and their details.\n"
                                                      "    4. If the '-p' option is specified, all handles containing the specified\n"
                                                      "       protocol will be displayed. Otherwise, the 'handle' parameter has to be\n"
                                                      "       specified for display. In this case, the '-d' option will be enabled\n"
                                                      "       automatically if the '-v' option is not specified.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display all handles one screen at a time:\n"
                                                      "    Shell> dh -b\n"
                                                      "    Handle dump\n"
                                                      "      1: Image(DXE Core)\n"
                                                      "      2: FwVol FwFileSys FwVolBlk DevPath(MemMap(11:1B50000-1D4FFC8))\n"
                                                      "      3: Image(Ebc)\n"
                                                      "      4: DevPath(MemMap(11:1CA0000-1CB0000))\n"
                                                      "      5: Image(WinNtThunk)\n"
                                                      "      6: WinNtThunk DevPath(..76F3-11D4-BCEA-0080C73C8881))\n"
                                                      "      7: Image(WinNtBusDriver) DriverBinding\n"
                                                      "      ...\n"
                                                      "\n"
                                                      "  * To display detailed information for handle 0x30:\n"
                                                      "    Shell> dh 30\n"
                                                      "    Handle 30 (01AF5308)\n"
                                                      "       IsaIo\n"
                                                      "         ROM Size......: 00000000\n"
                                                      "         ROM Location..: 00000000\n"
                                                      "         ISA Resource List :\n"
                                                      "           IO  : 000003F8-000003FF  Attr : 00000000\n"
                                                      "           INT : 00000004-00000000  Attr : 00000000\n"
                                                      "\n"
                                                      "       dpath\n"
                                                      "          PNP Device Path for PnP\n"
                                                      "           HID A0341D0, UID 0\n"
                                                      "          Hardware Device Path for PCI\n"
                                                      "          PNP Device Path for PnP\n"
                                                      "           HID 50141D0, UID 0\n"
                                                      "       AsStr: 'Acpi(PNP0A03,0)/Pci(1F|0)/Acpi(PNP0501,0)'\n"
                                                      "\n"
                                                      "\n"
                                                      "  * To display all handles associated with the 'diskio' protocol:\n"
                                                      "    Shell> dh -p diskio\n"
                                                      "    Handle dump by protocol 'Diskio'\n"
                                                      "     15: DiskIo BlkIo DevPath(..i(3|1)/Ata(Secondary,Master))\n"
                                                      "     16: DiskIo BlkIo DevPath(..,1)/PCI(0|0)/Scsi(Pun0,Lun0))\n"
                                                      "     44: DiskIo BlkIo fs DevPath(..ABD0-01C0-507B-9E5F8078F531)) ESP\n"
                                                      "     45: DiskIo BlkIo fs DevPath(..i(Pun0,Lun0)/HD(Part4,SigG0)) ESP\n"
                                                      "     17: DiskIo BlkIo DevPath(..PCI(3|1)/Ata(Primary,Master))\n"
                                                      "\n"
                                                      "  * To display all handles associated with the 'Image' protocol and break when\n"
                                                      "    the screen is full:\n"
                                                      "    Shell> dh -p Image -b\n"
                                                      "    Handle dump by protocol 'image'\n"
                                                      "      1: Image(DXE Core)\n"
                                                      "      5: Image(WinNtThunk)\n"
                                                      "      7: Image(WinNtBusDriver) DriverBinding\n"
                                                      "      8: Image(Metronome)\n"
                                                      "      A: Image(IsaBus) DriverBinding\n"
                                                      "      B: Image(WinNtConsole) DriverBinding\n" 
                                                      "      ...\n"

#string STR_SHELLENV_MAP_LINE_HELP     #language eng  "Displays or defines mappings"

#string STR_SHELLENV_MAP_VERBOSE_HELP  #language eng  "Displays or defines mappings between user defined names and device handles.\n"
                                                      "\n"
                                                      "MAP [-d <sname>]\n"
                                                      "MAP [[-r | -u][-v][-c][-f][-t <type[,type...]>][sname]]\n"
                                                      "MAP [sname handle | mapname]\n"
                                                      "    -d       - Delete a mapping\n"
                                                      "    -r       - Reset to default mappings\n"
                                                      "    -u       - Update mappings\n"
                                                      "    -v       - Display verbose mapping information\n"
                                                      "    sname    - User defined mapping name (wildcards are permitted)\n"
                                                      "    handle   - The number of handle, which is same as dumped from 'dh' command\n"
                                                      "    -c       - Display the consistent mapping name\n"
                                                      "    -f       - Display the normal mapping name(not consistent mapping)\n"
                                                      "    -t       - Display the device mapping name according to the device type:\n"
                                                      "                 fp   - Floppy\n"
                                                      "                 hd   - Hard Disk\n"
                                                      "                 cd   - CD-ROM\n"
                                                      "               Types can be combined by putting a comma between two types.\n"
                                                      "               Spaces are not allowed between types.\n"
                                                      "    mapname  - Mapped name for the device followed by a postfix ':'\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1.  The consistent mapping is persistent across the mapping reset and the\n"
                                                      "        system reboot.\n"
                                                      "    2.  Only characters and numbers are allowed inside of sname.\n"
                                                      "    3.  Redirection is not allowed when running map because we do not know the\n"
                                                      "        file system before mapping is done.\n"
                                                      "    4.  Output redirection is not supported for 'map -r' usage.\n"
                                                      "    5.  Option '-u' will only add/delete the mappings for new/removed devices.\n"
                                                      "        The unchanged device mappings with user-defined mappings are unchanged.\n"
                                                      "        The current dir, if current device is not changed, will also be\n"
                                                      "        preserved.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "\n"
                                                      "* To reset the mapping table to the default mappings:\n"
                                                      "shell> map -r\n"
                                                      "Device mapping table\n"
                                                      "  f4    :UnknownDevice - Alias fs0 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  fs0   :UnknownDevice - Alias f4 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  blk0  :UnknownDevice - Alias f4 fs0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To display all mappings in the device mapping table:\n"
                                                      "Shell> map\n"
                                                      "Device mapping table\n"
                                                      "  f4    :UnknownDevice - Alias fs0 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  fs0   :UnknownDevice - Alias f4 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  blk0  :UnknownDevice - Alias f4 fs0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To display verbose mapping table information:\n"
                                                      "Shell> map -v\n"
                                                      "Device mapping table\n"
                                                      "  f4     Consist Name f4\n"
                                                      "         Other Name   fs0 blk0 \n"
                                                      "         Handle       5F: Fs DiskIo BlkIo WinNtDriverIo \n"
                                                      "         Media Type   UnknownDevice\n"
                                                      "         Removable    NO\n"
                                                      "         Current Dir  \\\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  fs0    Consist Name f4\n"
                                                      "         Other Name   blk0 \n"
                                                      "         Handle       5F: Fs DiskIo BlkIo WinNtDriverIo \n"
                                                      "         Media Type   UnknownDevice\n"
                                                      "         Removable    NO\n"
                                                      "         Current Dir  \\\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  blk0   Consist Name f4\n"
                                                      "         Other Name   fs0 \n"
                                                      "         Handle       5F: Fs DiskIo BlkIo WinNtDriverIo \n"
                                                      "         Media Type   UnknownDevice\n"
                                                      "         Removable    NO\n"
                                                      "         Current Dir  \\\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To assign fs0 another name:\n"
                                                      "Shell> map floppy fs0:\n"
                                                      "  floppy:UnknownDevice - Alias f4 fs0 blk0\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To display information about the mapped name:\n"
                                                      "Shell> map floppy\n"
                                                      "  floppy:UnknownDevice - Alias f4 fs0 blk0\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To operate with the mapped name:\n"
                                                      "Shell> floppy:\n"
                                                      "floppy:\\> ls\n"
                                                      "\n"
                                                      "* To delete a mapped name:\n"
                                                      "Shell> map -d floppy\n"
                                                      "Shell> map\n"
                                                      "Device mapping table\n"
                                                      "  f4    :UnknownDevice - Alias fs0 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  fs0   :UnknownDevice - Alias f4 blk0\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  blk0  :UnknownDevice - Alias f4 fs0\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "\n"
                                                      "* To display all the mapped names starting with 'f':\n"
                                                      "Shell> map f*\n"
                                                      "Device mapping table\n"
                                                      "  f4    :UnknownDevice - Alias fs0 blk0 \n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"
                                                      "  fs0   :UnknownDevice - Alias f4 blk0\n"
                                                      "         Device Path  VenHw(58C518B1-76F3-11D4-BCEA-0080C73C8881)/VenHw(0C95A92F-A006-11D4-BCFA-0080C73C8881)\n"

#string STR_SHELLENV_CD_LINE_HELP      #language eng  "Displays or changes the current directory"

#string STR_SHELLENV_CD_VERBOSE_HELP   #language eng  "Displays or changes the current directory.\n"
                                                      "\n"
                                                      "CD [path]\n"
                                                      "    path     - The relative or absolute directory path\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. Type CD without parameters to display the current fs and directory.\n"
                                                      "    2. There must be at least one blank space between CD and path.\n"
                                                      "    3. The 'path' parameter supports certain special characters:\n"
                                                      "       - '.'  refers to the current directory.\n"
                                                      "       - '..' refers to the parent directory.\n"
                                                      "       - '\\' used at the beginning of the path refers to the root directory of\n"
                                                      "         the current filesystem.\n"
                                                      "    4. CD can only be used to change directories in the current file system.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To change the current filesystem to the mapped fs0 filesystem:\n"
                                                      "    Shell> fs0:\n"
                                                      "\n"
                                                      "  * To change the current directory to subdirectory 'efi':\n"
                                                      "    fs0:\\> cd efi\n"
                                                      "\n"
                                                      "  * To change the current directory to the parent directory (fs0:\\):\n"
                                                      "    fs0:\\efi\\> cd ..\n"
                                                      "\n"
                                                      "  * To change the current directory to 'fs0:\\efi\\tools':\n"
                                                      "    fs0:\\> cd efi\\tools\n"
                                                      "\n"
                                                      "  * To change the current directory to the root of the current fs (fs0):\n"
                                                      "    fs0:\\efi\\tools\\> cd \\ \n"
                                                      "    fs0:\\>\n"
                                                      "\n"
                                                      "  * To change volumes with cd will not work!! For example:\n"
                                                      "    fs0:\\efi\\tools\\> cd fs1:\\  !!!! will not work !!!!\n"
                                                      "    must first type fs1: then cd to desired directory\n"
                                                      "\n"
                                                      "  * To move between volumes and maintain the current path.\n"
                                                      "    fs0:\\> cd \\efi\\tools\n"
                                                      "    fs0:\\efi\\tools\\> fs1:\n"
                                                      "    fs1:\\> cd tmp\n"
                                                      "    fs1:\\tmp> cp fs0:*.* .\n"
                                                      "    copies all of files in fs0:\\efi\\tools into fs1:\\tmp directory\n" 

#string STR_SHELLENV_ECHO_LINE_HELP    #language eng  "Controls batch file command echoing or displays a message"

#string STR_SHELLENV_ECHO_VERBOSE_HELP #language eng  "Controls batch file command echoing or displays a message.\n"
                                                      "\n"
                                                      "ECHO [-on|-off]\n"
                                                      "ECHO [message]\n"
                                                      "\n"
                                                      "    -on      - Enable  echo when executing batch file commands\n"
                                                      "    -off     - Disable echo when executing batch file commands\n"
                                                      "    message  - Display a message string\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. Echo -off disables the echo feature when executing batch file commands.\n"
                                                      "       This command is not like the MS-DOS echo command.\n"
                                                      "    2. Echo without a parameter shows the current echo setting.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the current echo setting:\n"
                                                      "    fs0:\\> echo\n"
                                                      "    Echo is off\n"
													  "\n"
                                                      "  * To enable command echoing:\n"
                                                      "    fs0:\\> echo -on\n"
                                                      "\n"
                                                      "  * To disable command echoing:\n"
                                                      "    fs0:\\> echo -off\n"
                                                      "\n"
                                                      "  * To execute HelloWorld.nsh batch file and echo commands when executing:\n"
                                                      "    fs0:\\> HelloWorld.nsh\n"
                                                      "    +HelloWorld.nsh> echo Hello World\n"
                                                      "    Hello World\n" 
                                                      "\n"
                                                      "  * To display a message string of 'Hello World':\n"
                                                      "    fs0:\\> echo Hello World\n"
                                                      "    Hello World\n"

#string STR_SHELLENV_EXIT_LINE_HELP    #language eng  "Exits the EFI Shell environment"

#string STR_SHELLENV_EXIT_VERBOSE_HELP #language eng  "Exits the EFI Shell environment and returns control to the parent process.\n"
                                                      "\n"
                                                      "EXIT\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    Shell> exit\n"

#string STR_SHELLENV_IF_LINE_HELP      #language eng  "Executes commands in specified conditions"

#string STR_SHELLENV_IF_VERBOSE_HELP   #language eng  "Executes one or more commands in specified conditions.\n"
                                                      "\n"
                                                      "IF [NOT] EXIST file THEN\n"
                                                      "    command [arguments]\n"
                                                      "[ELSE\n"
                                                      "    command [arguments]]\n"
                                                      "ENDIF\n"
                                                      "\n"
                                                      "IF [NOT] string1 == string2 THEN\n"
                                                      "    command [arguments]\n"
                                                      "    [command [arguments]]\n"
                                                      "    ...\n"
                                                      "[ELSE\n"
                                                      "    command [arguments]\n"
                                                      "    [command [arguments]]\n"
                                                      "    ...]\n"
                                                      "ENDIF\n"
                                                      "\n"
                                                      "    EXIST file            - TRUE if file exists in the directory\n"
                                                      "    string1 == string2    - TRUE if the two stings are same\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The IF command is only available in batch script files.\n"
                                                      "    2. If condition is TRUE, commands between IF and ELSE will be\n"
                                                      "       executed.\n" 
                                                      "    3. If condition is FALSE but keyword 'NOT' is not prefixed, commands\n" 
                                                      "       between ELSE and ENDIF will also be executed.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    #\n"
                                                      "    #  Example script for \"if\" command\n"
                                                      "    #\n"
                                                      "    if exist fs0:\\myscript.sc then\n"
                                                      "    myscript myarg1 myarg2\n"
                                                      "    endif\n"
                                                      "    if %%myvar%% == runboth then\n"
                                                      "    myscript1\n"
                                                      "    myscript2\n"
                                                      "    endif\n"

#string STR_SHELLENV_GOTO_LINE_HELP    #language eng  "Forces batch file execution to jump to specified location"

#string STR_SHELLENV_GOTO_VERBOSE_HELP #language eng  "Forces batch file execution to unconditionally jump to specified location.\n"
                                                      "\n"
                                                      "GOTO label\n"
                                                      "\n"
                                                      "    label    - Specifies a location in batch file\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The GOTO command is only available in batch script files.\n"                                                      
                                                      "    2. Execution of batch file will jump to the line immediately following the\n"
                                                      "       specified label name.\n"
                                                      "    3. GOTO cannot jump from outside into a FOR cycle block.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "    #\n"
                                                      "    #  Example script for \"goto\" command\n"
                                                      "    #\n"
                                                      "    goto Done\n"
                                                      "    ...\n"
                                                      "    :Done\n"
                                                      "    cleanup.nsh\n"

#string STR_SHELLENV_FOR_LINE_HELP     #language eng  "Executes commands for each item in a set of items"

#string STR_SHELLENV_FOR_VERBOSE_HELP  #language eng  "Executes one or more commands for each item in a set of items.\n"
                                                      "\n"
                                                      "FOR %%indexvar IN set\n"
                                                      "    command [arguments]\n"
                                                      "    [command [arguments]]\n"
                                                      "     ...\n"
                                                      "ENDFOR\n"
                                                      "\n"
                                                      "FOR %%indexvar RUN (start end[ step])\n"
                                                      "    command [arguments]\n"
                                                      "    [command [arguments]]\n"
                                                      "    ...\n"
                                                      "ENDFOR\n"
                                                      "\n"
                                                      "    %%indexvar           - Variable name used to index a set\n"
                                                      "    set                  - Set to be searched\n"
                                                      "    command [arguments]  - Command to be executed with optional arguments\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The FOR command is only available in batch script files.\n"
                                                      "    2. FOR shall be matched with ENDFOR.\n"
                                                      "    3. start and end can be any integer.  Up to 6 digits allowed.\n"
                                                      "    4. step can be any integer but zero.  Up to 6 digits allowed.\n"
                                                      "    5. step is optional, if step is not specified, step will be automatically\n"
                                                      "       determined as below:\n"
                                                      "         if start <= end, then step = 1\n"
                                                      "         if start > end,  then step = -1\n"                                                                                                       
                                                      "\n"
                                                      "Examples:\n"
                                                      "    #\n"
                                                      "    #  Sample for loop type contents of all *.txt files\n"
                                                      "    #\n"
                                                      "    for %%a in *.txt\n"
                                                      "       type %%a\n"
                                                      "       echo ===== %%a done =====\n"
                                                      "    endfor\n" 
                                                      "\n"
                                                      "    #\n"
                                                      "    #  To repeat operations, supporting multiple loop:\n"
                                                      "    #\n"
                                                      "        for %%a in 1 2 3 4 5 6 7 8 9\n"
                                                      "          for %%b in a b c d e f g h i j k l m n o p q r s t u v w x y z\n"
                                                      "            alias %%a a%%a\n"
                                                      "            alias %%b %%b%%a\n"
                                                      "          endfor\n"
                                                      "        endfor\n"
                                                      "\n"
                                                      "        for %%a run (1 3)\n"
                                                      "          echo %%a\n"
                                                      "        endfor\n"
                                                      "Output:\n"
                                                      "1\n2\n3\n\n"
                                                      "        for %%a run (3 1)\n"
                                                      "          echo %%a\n"
                                                      "        endfor\n"
                                                      "Output:\n"
                                                      "3\n2\n1\n"

#string STR_SHELLENV_SHIFT_LINE_HELP   #language eng  "Shifts batch file input parameter positions"

#string STR_SHELLENV_SHIFT_VERBOSE_HELP #language eng "Shifts batch file input parameter positions.\n"
                                                      "\n"    
                                                      "SHIFT\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "\n"
                                                      "    1. The SHIFT command is only available in batch script files.\n"
                                                      "    2. Each time the SHIFT command is executed the parameters are shifted one\n"
                                                      "       position higher, giving you access to more than ten parameters.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "\n"
                                                      "  * To execute a batch file named MySript.nsh:\n"
                                                      "    fs0:\\> MyScript.nsh X1 X2 X3 X4 X5 X6 X7 X8 X9 X10\n"
                                                      "\n"
                                                      "    The parameters available when MyScript.nsh initially begins execution will\n"
                                                      "    be set as follows:\n"
                                                      "    %%1 = X1\n"
                                                      "    %%2 = X2\n"
                                                      "    %%3 = X3\n"
                                                      "    %%4 = X4\n"
                                                      "    %%5 = X5\n"
                                                      "    %%6 = X6\n"
                                                      "    %%7 = X7\n"
                                                      "    %%8 = X8\n"
                                                      "    %%9 = X9\n"
                                                      "\n"
                                                      "  * To shift the parameters one position inside the batch file:\n"
                                                      "    shift\n"
                                                      "\n"
                                                      "    The parameters available in MyScript.nsh are changed as follows:\n"
                                                      "    %%1 = X2\n"
                                                      "    %%2 = X3\n"
                                                      "    %%3 = X4\n"
                                                      "    %%4 = X5\n"
                                                      "    %%5 = X6\n"
                                                      "    %%6 = X7\n"
                                                      "    %%7 = X8\n"
                                                      "    %%8 = X9\n"
                                                      "    %%9 = X10\n"
                                                      
#string STR_SHELLENV_PAUSE_LINE_HELP   #language eng  "Prints a message and waits for keyboard input"

#string STR_SHELLENV_PAUSE_VERBOSE_HELP #language eng "Prints a message and waits for keyboard input.\n"
                                                      "\n"    
                                                      "PAUSE [-q]\n"
                                                      "\n"
                                                      "    -q       - Do not display notification message\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The PAUSE command is only available in batch script files.\n"
                                                      "    2. The prompt message is \"Enter 'q' to quit, any other key to continue\".\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "\n"
                                                      "  * To pause the system after displaying the date and time:\n"
                                                      "    fs0:\\> type pause.nsh\n"
                                                      "    File: fs0:\\pause.nsh, Size 204\n"
                                                      "    #\n"
                                                      "    #  Example script for 'pause' command\n"
                                                      "    #\n"
                                                      "    echo pause.nsh begin..\n"
                                                      "    date\n"
                                                      "    time\n"
                                                      "    pause\n"
                                                      "    echo pause.nsh done.\n"
                                                      "\n"
                                                      "  * To execute the script with echo on:\n"   
                                                      "    fs0:\\> pause.nsh\n"
                                                      "    +pause.nsh> echo pause.nsh begin..\n"
                                                      "    pause.nsh begin..\n"
                                                      "    +pause.nsh> date\n"
                                                      "    06/19/2001\n"
                                                      "    +pause.nsh> time\n"
                                                      "    00:51:45\n"
                                                      "    +pause.nsh> pause\n"
                                                      "    Enter 'q' to quit, any other key to continue:\n"
                                                      "    +pause.nsh> echo pause.nsh done.\n"
                                                      "    pause.nsh done.\n"
                                                      "\n"
                                                      "  * To execute the script with echo off:\n"
                                                      "    fs0:\\> echo -off\n"
                                                      "    fs0:\\> pause.nsh\n"
                                                      "    pause.nsh begin..\n"
                                                      "    06/19/2001\n"
                                                      "    00:52:50\n"
                                                      "    Enter 'q' to quit, any other key to continue: q\n"
                                                      "    fs0:\\>\n"
